*&---------------------------------------------------------------------*
*& Include          MZDEMO_05I01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0100 INPUT.
  CASE OK_CODE.
    WHEN 'BACK'.
      LEAVE TO SCREEN 0. "이전 화면으로 돌아감
    WHEN 'CANCEL'.
      LEAVE TO SCREEN 0.
    WHEN 'EXIT'.
      LEAVE PROGRAM. "프로그램 종료
    WHEN OTHERS.
  ENDCASE.
ENDMODULE.
*&---------------------------------------------------------------------*
*&      Module  TRANS_FROM_DATA  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE trans_from_data INPUT.
  MOVE-CORRESPONDING SDYN_CONN TO WA_SPFLI. "TOP 에서 선언된 WA_SPFLI를 사용하는 것으로 받아온 값을 SDYN_CONN에 넣어줌

ENDMODULE.
