*&---------------------------------------------------------------------*
*& Include          ZALV_PRG_05I01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE user_command_0100 INPUT.
  CASE OK_CODE.
    WHEN 'BACK'.
      LEAVE TO SCREEN 0. "BACK 버튼 누르면 이전 스크린으로
    WHEN 'CANC'.
      LEAVE TO SCREEN 0. "CANC 버튼 누르면 이전 스크린으로
    WHEN 'EXIT'.
      LEAVE PROGRAM. "EXIT버튼 누르면 프로그램 종료
  ENDCASE.
ENDMODULE.
